verilog_defaults -add -D CHECK_OUTPUTS
read_verilog -sv ../../../partitions/jpeg_encoder.rle.rz3.deno_DFFE_PN0P_.adacond0.sv
read_rtlil ../../../partitions/jpeg_encoder.rle.rz3.deno_DFFE_PN0P_.adacond0.il
hierarchy -top miter; proc; chformal -cover -remove
async2sync
formalff -clk2ff -ff2anyinit gate.jpeg_encoder.rle.rz3.deno_DFFE_PN0P_.adacond0
setundef -anyseq gate.jpeg_encoder.rle.rz3.deno_DFFE_PN0P_.adacond0
flatten -wb; dffunmap; opt_expr -keepdc -undriven; opt_clean
sat -tempinduct -set-init-undef -set-def-formal -set-def-inputs -maxsteps 10 -set-assumes -prove-asserts -show-public -dump_vcd trace.vcd miter
