verilog_defaults -add -D CHECK_OUTPUTS
read_verilog -sv ../../../partitions/aes_cipher_top.u0.r0.out.27_SDFF_PP0_.CLK.sv
read_rtlil ../../../partitions/aes_cipher_top.u0.r0.out.27_SDFF_PP0_.CLK.il
hierarchy -top miter; proc; chformal -cover -remove
async2sync
formalff -clk2ff -ff2anyinit gate.aes_cipher_top.u0.r0.out.27_SDFF_PP0_.CLK
setundef -anyseq gate.aes_cipher_top.u0.r0.out.27_SDFF_PP0_.CLK
flatten -wb; dffunmap; opt_expr -keepdc -undriven; opt_clean
sat -tempinduct -set-init-undef -set-def-formal -set-def-inputs -maxsteps 10 -set-assumes -prove-asserts -show-public -dump_vcd trace.vcd miter
