read_verilog -sv ./results/asap7/jpeg/base/4_before_rsz.v /ml_placer/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_INVBUF_RVT_TT_201020.v /ml_placer/flow/platforms/asap7/work_around_yosys/asap7sc6t_INVBUF_RVT_FF_210930.v /ml_placer/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_SEQ_RVT_TT_220101.v /ml_placer/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_OA_RVT_TT_201020.v /ml_placer/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_AO_RVT_TT_201020.v /ml_placer/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_SIMPLE_RVT_TT_201020.v
prep -top jpeg_encoder -flatten
memory_map
opt_clean
check -initdrv
setundef -undriven -undef
write_rtlil ./logs/asap7/jpeg/base/4_eqy_output/gold.il
